package com.ssafy.likloud.ui.game

import com.ssafy.likloud.data.model.QuestionDto

object QuestionLIist {

    val questionList = listOf<QuestionDto>(
        QuestionDto("우리나라 계절은 몇 개인가요?", "2개","4개", "4개"),
        QuestionDto("낮과 밤의 시간이 거의 같아지는 특별한 날은 무엇인가요?", "춘분","하지", "춘분"),
        QuestionDto("여름에 특히 더워지는 바람은 무엇인가요?", "열대야","한파", "열대야"),
        QuestionDto("날씨를 예측하는 데 사용되는 도구 중 하나로, 기온, 습도, 기압 등을 측정하는 기기는 무엇인가요? ", "기상 관측기","기상 관측망", "기상 관측기"),
        QuestionDto("태풍은 바다 위에서 발생하며, 바람의 속도가 몇 이상일 때 태풍으로 분류되나요?", "88km/h","118km/h", "118km/h"),
        QuestionDto("눈이 오는 날씨에 땅이 서늘해지면서 생기는 미끄러운 현상을 뭐라고 할까요?", "결빙","홍수", "결빙"),
        QuestionDto("해수면 위로 올라와 구름으로 변하는 물의 상태를 뭐라고 할까요?", "김","수증기", "수증기"),
        QuestionDto("대기 중에서 가장 많은 양을 차지하는 기체는 무엇인가요?", "산소","질소", "질소"),
        QuestionDto("물과 함께 공기에서 존재하는 미세한 물방울이나 얼음 결정은 무엇일까요?", "구름","눈", "구름"),
        QuestionDto("바다에서 육지로 불어오는 바람을 뭐라고 부를까요?", "육풍","해풍", "해풍"),
        QuestionDto("구름이 매우 낮은 곳까지 내려와 땅과 건물을 뒤덮는 현상을 뭐라고 할까요?", "안개","운류", "안개"),
        QuestionDto("태양이 지면에서 서쪽으로 움직이며 해가 저물어 가는 현상을 뭐라고 할까요?", "일출","일몰", "일몰"),
        QuestionDto("매년 정해진 날짜에 새로운 계절이 시작되는데, 이를 뭐라고 할까요?", "철","절기", "절기"),
        QuestionDto("태양이 가장 높이 떠오르는 시간은 언제인가요?", "정오","자정", "정오"),
        QuestionDto("한반도에서 강풍과 함께 찬 공기가 불어오면서 기온이 크게 떨어지는 날씨 현상을 뭐라고 할까요?", "북풍","남풍", "북풍"),
        QuestionDto("다음 중 구름인 것은 무엇일까요?", "땅거미운","고적운", "고적운"),
        QuestionDto("햇빛에 비춰서 구름이 붉게 물들일 때, 그 구름의 이름은 무엇일까요?", "적운","황혼구름", "황혼구름"),
        QuestionDto("두 구름 중 더 높은 고도에서 형성되는 구름은 무엇일까요?", "측우운","적운", "적운"),
        QuestionDto("두 구름 중 구름을 형성하는 물방울의 크기가 더 작은 구름은 무엇일까요?", "측우운","층운", "층운"),
        QuestionDto("맑은 날씨와 관련 있는 바람은 무엇일까요?", "동풍","남풍", "동풍"),
        QuestionDto("낮은 대기 압력과 연관된 날씨는 어떤 특징을 가질까요?", "맑은 하늘","비와 뇌우", "비와 뇌우"),
        QuestionDto("기온이 급격히 떨어질 때 나타나는 기상 현상은 무엇일까요?", "강한 바람","서리", "서리"),
        QuestionDto("기압이 급격히 떨어질 때 나타나는 기상 현상은 무엇일까요?", "비와 뇌우","맑은 하늘", "비와 뇌우"),
        QuestionDto("열대 지역에서 발생하는 강한 폭풍은 어떤 이름으로 불리나요?", "토네이도","허리케인", "허리케인"),
        QuestionDto("해수면 온도가 높아질 경우 증가하는 기상 현상은 무엇일까요?", "폭풍우","기온 급강하", "폭풍우"),
        QuestionDto("높은 고도에서는 기온이 어떻게 변할까요?", "상승","하강", "하강"),
        QuestionDto("고도가 높아질수록 대기의 양은 어떻게 변할까요?", "증가","감소", "감소"),
        QuestionDto("한 지역에서 연달아 내리는 비의 양이 많아지는 현상을 뭐라고 할까요?", "장마","홍수", "장마"),
        QuestionDto("물방울이나 눈이 하늘에서 내려오는 현상을 뭐라고 할까요?", "증발","강우", "강우"),
        QuestionDto("빙하나 눈이 녹아 물이 되는 현상을 뭐라고 부를까요?", "우박","녹방", "녹방")
    )

}